{"class_name": "Functional", "config": {"name": "model_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 360, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_112", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_112", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_113", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_113", "inbound_nodes": [[["conv1d_112", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_104", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_104", "inbound_nodes": [[["conv1d_113", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_114", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_114", "inbound_nodes": [[["re_lu_104", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_105", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_105", "inbound_nodes": [[["conv1d_114", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_40", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [5], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_40", "inbound_nodes": [[["re_lu_105", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_115", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_115", "inbound_nodes": [[["max_pooling1d_40", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_106", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_106", "inbound_nodes": [[["conv1d_115", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_116", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_116", "inbound_nodes": [[["re_lu_106", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_107", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_107", "inbound_nodes": [[["conv1d_116", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_41", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [5], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_41", "inbound_nodes": [[["re_lu_107", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_117", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_117", "inbound_nodes": [[["max_pooling1d_41", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_108", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_108", "inbound_nodes": [[["conv1d_117", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_118", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_118", "inbound_nodes": [[["re_lu_108", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_109", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_109", "inbound_nodes": [[["conv1d_118", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_119", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_119", "inbound_nodes": [[["re_lu_109", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_110", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_110", "inbound_nodes": [[["conv1d_119", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_42", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [5], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_42", "inbound_nodes": [[["re_lu_110", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_120", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_120", "inbound_nodes": [[["max_pooling1d_42", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_111", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_111", "inbound_nodes": [[["conv1d_120", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_121", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_121", "inbound_nodes": [[["re_lu_111", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_112", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_112", "inbound_nodes": [[["conv1d_121", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_122", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_122", "inbound_nodes": [[["re_lu_112", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_113", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_113", "inbound_nodes": [[["conv1d_122", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_43", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [5], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_43", "inbound_nodes": [[["re_lu_113", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_123", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_123", "inbound_nodes": [[["max_pooling1d_43", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_114", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_114", "inbound_nodes": [[["conv1d_123", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_124", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_124", "inbound_nodes": [[["re_lu_114", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_115", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_115", "inbound_nodes": [[["conv1d_124", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_125", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_125", "inbound_nodes": [[["re_lu_115", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_116", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_116", "inbound_nodes": [[["conv1d_125", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_44", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [5], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_44", "inbound_nodes": [[["re_lu_116", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_8", "inbound_nodes": [[["max_pooling1d_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["flatten_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["dense_25", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["dense_26", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}